export const incoterms = [
  "EXW",
  "FCA",
  "CTP",
  "CIP",
  "DAP",
  "DPU",
  "DDP",
  "CFR",
  "FOB",
  "FAS",
  "CIF",
];

export const containersTypes = [
  "20'",
  "40'",
  "20HC",
  "40HC",
  "20 open top",
  "40 open top",
  "Flat Rack (контейнер для перевозки негабаритов)",
  "Tank (для жидких и газообразных грузов)",
  "20 ADR",
  "40 ADR",
  "20 Ref",
  "40 Ref",
  "BU (для насыпных грузов)",
  "Авто 82 куба",
  "Авто 90 кубов",
  "Авто 120 кубов МЕГА",
  "Сборный груз",
  "Авиа",
];

export const contractType = [
  "Прямой контакт",
  "Брокерский контракт",
  "Агентский договор",
  "Только услуги логистики",
  "Только услуги таможенного оформления",
  "Только сертификация",
  "Только финансовые услуги",
];

export const clientStatusArray = [
  "Выхожу на специалиста",
  "Вышел на специалиста, но не отправлял КП",
  "Отправил КП",
  "Получил запрос",
  "Клиент уже работает с другим менеджером",
  "Клиент отдал нам груз",
  "Раньше с ними работали, но прекратили",
];

// Order Data
export const orderPoints = [
  "pickupAddress",
  "typeOfCargo",
  "hsCode",
  "weight",
  "volume",
  "package",
  "special",
  "customs",
  "deliveryAddress",
  "pickupDate",
  "howOften",
  "addition",
  "incoterms",
  "containersTypes",
  "contractType",
  "transshipment",
  "hazard",
  "temperature",
];

export const orderPointsLabel = [
  "Откуда забирать груз",
  "Характер груза",
  "Код ТН ВЭД",
  "Точный вес груза",
  "Точный объём груза",
  "Как упакован груз",
  "Особые условия",
  "Таможенный пост",
  "Адрес доставки",
  "Когда забирать груз",
  "Как часто возит",
  "Примечание",
  "Инкотермс",
  "Тип перевозки",
  "Тип контракта",
  "Можно ли штабелировать груз",
  "Опасный груз или нет",
  "Температурный режим груза",
];

export const companyInformation = [
  "Направление",
  "Сфера деятельности",
  "Тип контракта",
  "Тип перевозки",
];
